

# # 리스트의 인덱싱
# A = [1, 2, 3]
# print(A)

# # [1, 2, 3]

# print(A[0])

# # 1

# print(A[0] + A[2])

# # 4


# A = [1, 2, 3, ['a', 'b', 'c']]
# print(A[0])

# # 1

# print(A[-1])

# # ['a', 'b', 'c']

# print(A[3])

# # ['a', 'b', 'c']

# print(A[-1][0])

# # 'a'


# # 삼중 리스트에서 인덱싱하기
# A = [1, 2, ['a', 'b', ['Life', 'is']]]
# print(A[2][2][0])

# # Life


# # 리스트의 슬라이싱
# A = [1, 2, 3, 4, 5]
# print(A[0:2])

# # [1, 2]


# # 리스트 더하기 (+)
# A = [1, 2, 3]
# B = [4, 5, 6]
# print(A + B)

# # [1, 2, 3, 4, 5, 6]


# # 리스트 반복하기 (*)
# A = [1, 2, 3]
# print(A * 3)

# # [1, 2, 3, 1, 2, 3, 1, 2, 3]


# # 리스트 길이 구하기
# A = [1, 2, 3]
# print(len(A))

# # 3


# # 리스트에서 값 수정하기
# A = [1, 2, 3]
# A[2] = 4
# print(A)

# # [1, 2, 4]


# # 리스트에서 값 삭제하기
# A = [1, 2, 3, 4, 5]
# del A[2:]
# print(A)

# # [1, 2]


# # 리스트에 요소 추가 (append)
# A = [1, 2, 3]
# A.append(4)
# print(A)

# # [1, 2, 3, 4]